In [16]:
import pandas as pd


df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Alice', 'Bob', 'Charlie'],
    'Score': [85, 90, 88, 92, 95]
})


var_new = df.groupby('Name')


for x, y in var_new:
    print(x)
    print(y)

Alice
    Name  Score
0  Alice     85
2  Alice     88
Bob
  Name  Score
1  Bob     90
3  Bob     92
Charlie
      Name  Score
4  Charlie     95

In [19]:
var_new .get_group("Alice")

    Name  Score
0  Alice     85
2  Alice     88

In [20]:
var_new.max()

         Score
Name
Alice       88
Bob         92
Charlie     95

In [22]:
var_new.min()

         Score
Name
Alice       85
Bob         90
Charlie     95

In [23]:
var_new.mean()

         Score
Name
Alice     86.5
Bob       91.0
Charlie   95.0

In [24]:
var_new.all()

         Score
Name
Alice     True
Bob       True
Charlie   True